[
	{
		"title": "60 Second Soapbox",
		"slug": "60-second-soapbox",
		"url": "https://60secondsoapbox.io",
		"icon": "soapbox-logo.png",
		"tech": [
			"VueJs", "Laravel", "WebRTC", "Mailgun"
		],
		"screenshots": [
			"soapbox1.jpg",
			"soapbox2.jpg",
			"soapbox3.jpg"
		],
		"intro": "<p>60secondsoapbox.io is a web application which allows users to participate in the <a href=\"https://www.aliem.com/category/clinical/60-second-soapbox/\" target=\"_blank\">ALiEM 60 Second Soapbox</a> podcast. Invited users can sign in with an invitation code, and record one minute of audio which is then released as part of the podcast. </p>",
		"details": "<p>The app features an in-browser recording interface which captures audio through the device's microphone using WebRTC. Recorded audio is then uploaded, processed, and can be previewed before submission. Submissions are handled by administrators through a simple back-end that allows for user management and content customization.</p><p>The app is built with <a href=\"https://laravel.com\" target=\"_blank\">Laravel</a> and <a href=\"https://vuejs.org\" target=\"_blank\">VueJs</a>. WebRTC audio capture is accomplished via <a href=\"http://recordrtc.org\" target=\"_blank\">RecordRTC</a>, and server side audio processing is done with <a href=\"https://ffmpeg.org\" target=\"_blank\">FFmpeg</a>. Audio waveforms are generated and displayed with <a href=\"https://wavesurfer-js.org/\" target=\"_blank\">Wavesurfer-js.</a></p>"
	},
	{
		"title": "Westin CLE Art Tour",
		"slug": "westin",
		"url": "https://play.google.com/store/apps/details?id=com.westin.arttour&hl=en&utm_source=global_co&utm_medium=prtnr&utm_content=Mar2515&utm_campaign=PartBadge&pcampaignid=MKT-Other-global-all-co-prtnr-py-PartBadge-Mar2515-1",
		"urlTitle": "Google Play",
		"icon": "westin-logo.png",
		"tech": [
			"Vanilla JS", "Cordova"
		],
		"screenshots": [
			"westin1.jpg",
			"westin2.jpg",
			"westin3.jpg"
		],
		"intro": "<p>Westin CLE Art Tour is a mobile application that allows guests to learn more about the artwork on display at the Westin Cleveland Hotel through augmented reality. Hotel guests can view details about the art or artist by pointing their device's camera at a painting, photograph, or sculpture.</p>",
		"details": "<p>The app is available on both iOS and Andriod, and is built with javascript (ES6 & Babel) and compiled into native apps with <a href=\"https://cordova.apache.org/\" target=\"_blank\">Cordova.</a> Content and augmented reality tracking data are pulled from a live server via JSON, allowing content updates to be made without submitting a new version of the app to the App Store/Google Play. Augmented reality features are accomplished with <a href=\"https://www.wikitude.com/\" target=\"_blank\">Wikitude.</a></p>"
	},
	{
		"title": "Iris",
		"slug": "iris",
		"url": "http://irisapp.io",
		"icon": "iris-logo.gif",
		"tech": [
			"Angular", "PHP"
		],
		"screenshots": [
			"iris1.jpg",
			"iris2.jpg",
			"iris3.jpg"
		],
		"intro": "<p><a href=\"https://irisapp.io\" target=\"_blank\">Iris</a> is the in-house content management system at <a href=\"https://stream9.net\" target=\"_blank\">Stream 9.</a> My primary responsibilities included building the front-end, and collaborating with the lead back-end developer to design an API through which the app communicates with the server.</p>",
		"details": "<p>Iris is comprised of a PHP/MySQL back-end running <a href=\"https://github.com/liftkit/liftkit\" target=\"_blank\">LiftKit</a>, and a SPA client built with <a href=\"https://angularjs.org/\" target=\"_blank\">AngularJs.</a> The interface features a card-based layout, and is heavily inspired by Google's <a href=\"https://material.io/guidelines/\" target=\"_blank\">Material Design.</a> Currently in use by the majority of Stream 9's clients, Iris is a modular, customizable CMS that allows each installation to be tailored to a client's specific needs.</p>"
	},
	{
		"title": "Inline",
		"slug": "inline",
		"url": "http://inlineapp.io",
		"icon": "inline-logo.png",
		"tech": [
			"Angular", "PHP"
		],
		"screenshots": [
			"inline2.jpg",
			"inline3.jpg",
			"inline4.jpg"
		],
		"intro": "<p><a href=\"https://inlineapp.io\" target=\"_blank\">Inline</a> is a project management application for small teams, originally developed as an internal project at Stream 9. After being dissatisfied with other project management software we had tried, we eventually decided to build our own solution.</p>",
		"details": "<p>Inline is designed around the age-old concept of a todo list, but one that is organized by users, and by 'teams' to which users are assigned. Tasks can be dragged to other users or teams, and are further organized into three lists: 'Current', 'On Hold', and 'Complete'. Tasks can be viewed in two primary modes, 'Team View' and 'Profile View'. Small teams of web developers are often required to juggle multiple tasks in multiple projects, and Inline displays these tasks in a straightforward way that allows all team members to be aware of who's working on what and when. Inline is built with a PHP/MySQL back-end running <a href=\"https://github.com/liftkit/liftkit\" target=\"_blank\">LiftKit</a>, and a SPA client built with <a href=\"https://angularjs.org/\" target=\"_blank\">AngularJs.</a></p>"
	},
	{
		"title": "Zenuworld",
		"slug": "zenuworld",
		"icon": "zenuworld-logo.png",
		"tech": [
			"Angular", "PHP", "Authorize.net"
		],
		"screenshots": [
			"zenuworld1.jpg",
			"zenuworld2.jpg",
			"zenuworld3.jpg"
		],
		"intro": "<p>Zenuworld is a business-to-business social network that facilities cooperation between industrial suppliers/distributors and small businesses in the United States and China. In their own words: \"Small and mid-size enterprises account for over 50% of the world’s workforce and contribute over 50% of world GDP. Although there are substantial global growth opportunities, it is often too expensive and too resource-intensive for SMEs to pursue these opportunities. Zenuworld provides a network for connecting with SMEs all around the world, leveling the playing field for smaller enterprises and opening opportunities that are too often missed.\"</p>",
		"details": "<p>Zenuworld allows users to search the profiles of potential business partners and suppliers and facilitates networking between these parties with an internal messaging system. Searches can be conducted within specific industry classifications, company sizes, or locations. The site also features a social media 'news feed' and a 'connections' system allowing users to request/approve/deny a connection with other users. Zenuworld is built with PHP/MySQL on the server side, and an <a href=\"https://angularjs.org\" target=\"_blank\">AngularJs</a> client. In-app payments are processed with <a href=\"http://authorize.net\" target=\"_blank\">Authorize.net</a></p>"
	}
]